import groceryimg from "../images/grocery-final.png"
import adventureimg from "../images/adventure-final.png"
import furnitureimg from "../images/furniture-final.png"
import educationimg from "../images/education-final.png"
import zabinimg from "../images/zabin-final.jpg"
import smallimg from "../images/small-project-final.jpg"
import contactimg from "../images/contact-manager.jpg"
import flowerimg from "../images/flower-final.png"
import rentcarimg from "../images/rentcar-final.png"
import learningimg from "../images/learning-final.png"


import groceryvid from "../videoes/grocery.mp4"
import adventurevid from "../videoes/adventure.mp4"
import furniturevid from "../videoes/20231008_123819.mp4"
import contactvid from "../videoes/contact-manager.mp4"
import educationvid from "../videoes/education.mp4"
import flowervid from "../videoes/flowerShop.mp4"
import rentcarvid from "../videoes/RentCar.mp4"
import smallprojectvid from "../videoes/small-project.mp4"
import learningvid from "../videoes/learning.mp4"

export const projectData = [

    {
        id: "1",
        image: learningimg,
        video: learningvid,
        title: "سایت آموزش آنلاین",
        content: "نمونه سایتی مشابه با سایت های آموزشی که شامل دو بخش می باشد.یک بخش برای نمایش آموزش ها که کاربران می توانند داخل سایت جستجو کرده و آموزش های دلخواه خودشون رو پیدا کرده و مشاهده کنن یا نظرات خودشون رو در مورد هر آموزش بیان کنند و ... .بخش دیگر مختص admin هست که با ورود به سایت میتونه آموزشی رو ایجاد،ویرایش یا حذف کنه",
        // fullcontent: "نمونه سایتی مشابه با سایت های آموزشی که شامل دو بخش می باشد.یک بخش برای نمایش آموزش ها که کاربران می توانند داخل سایت جستجو کرده و آموزش های دلخواه خودشون رو پیدا کرده و مشاهده کنن یا نظرات خودشون رو در مورد هر آموزش بیان کنند و ... .بخش دیگر مختص admin هست که با ورود به سایت میتونه آموزشی رو ایجاد،ویرایش یا حذف کنه.نه تنها آموزش ها بلکه اساتید،دسته بندی ها و ... رو نیز میتونه ایجاد،ویرایش و یا حذف کنه.برنامه نویسی سایت نیز شامل دو بخش front-end و back-end هست در بخش front-end از react،tailwind،javascript،html و css بهره بردم و برای بخش back-end سایت نیز از nodejs و javascript و پایگاه داده mongoDB استفاده کردم.در این سایت موارد مختلفی پیاده سازی شده که شرح هر کدام از اون ها رو در ادامه بیان میکنم.1-برای مدیریت stateهامون از redux و برای برقراری ارتباط با server از axios استفاده شده.عملیات های CRUD ما بر روی سه بخش (آموزش ها،اساتید و دسته بندی ها) صورت میگیره و به این صورت عمل می کنه که به طور مثال برای ساخت یک آموزش ،تمامی اطلاعات وارد شده توسط admin که به وسیله ی فرم گرفته می شه به سمت server ارسال شده و در back-end صحت اطلاعات بررسی میشه و در صورت صحیح بودن،این اطلاعات در پایگاه داده ذخیره شده و پیغام موفقیت آمیز بودن عملیات برای ما ارسال میشه.2-همان طور که قبلا اشاره شد سایت ما دارای دو بخش می باشد که یک بخش برای کاربران عادی و بخش دیگر برای admin طراحی شده.کاربران عادی برای برخی مسائل مثل نظر دادن یا ثبت نام در یک آموزش نیازمند ثبت نام در سایت و login هستند.admin نیز برای دسترسی به بخش مخصوص خودش که در اون بخش توانایی ایجاد،ویرایش و حذف (آموزش ها،اساتید و دسته بندی ها) رو داره باید login کنه.باید توجه داشته باشید که کاربران به قسمت admin سایت دسترسی ندارند.3-توانایی جستجو کردن برای آموزش ها،اساتید و دسته بندی ها در سایت موجود هست.همچنین آموزش ها رو می توان بر اساس قیمتشون و یا تاریخ ایجادشون فیلتر کرد.4-آموزش ها،اساتید و دسته بندی ها همگی دارای صفحه بندی می باشند و کاربر به راحتی میتونه به صفحات مختلف رفته و آموزش ها و یا هر آن چیزی که مد نظرش هست رو پیدا کنه.5-این سایت دارای سبد خرید نیز هست و هر کاربری می تونه آموزش های مدنظرش رو انتخاب کرده و خریداری کنه.6-سایت responsive بوده و در نمایشگرهای مختلف به خوبی نمایش داده می شه.7-تمامی فرم های موجود در سایت دارای validation هستند و تمامی سناریوهای مخربی که ممکن هست توسط کاربران پیش بیاد سازماندهی شده و پیام های مرتبط با اون ها ارسال می شود.",
        fullcontent:
            `
                        <div class="user-card">
                         <p>نمونه سایتی مشابه با سایت های آموزشی که شامل دو بخش می باشد.</P>
                         <ul>
                         <li><b style="color:red">بخش اول نمایش سایت :</b>  بخشی از سایت که تمامی آموزش ها،دسته بندی ها،اساتید و ... به نمایش گزاشته شده و کاربران می توانند داخل سایت جستجو کرده و آموزش های دلخواه خودشون رو پیدا و مشاهده کنن یا نظرات خودشون رو در مورد هر آموزش بیان کنند .</li>
                         <li><b style="color:red">بخش دوم admin سایت :</b> در این بخش مدیر سایت یا admin میتونه با ورود به سایت و login کردن آموزشی رو ایجاد،ویرایش یا حذف کنه.نه تنها آموزش ها بلکه اساتید،دسته بندی ها و ... رو نیز میتونه ایجاد،ویرایش و یا حذف کنه.</li>
                         </ul>
                         <p style="margin-top:15px">برنامه نویسی سایت نیز شامل دو بخش <b style="color:red">front-end</b> و <b style="color:red">back-end</b> هست در بخش front-end از react،tailwind،javascript،html و css بهره بردم و برای بخش back-end سایت نیز از nodejs و javascript و پایگاه داده mongoDB استفاده کردم.در این سایت موارد مختلفی پیاده سازی شده که شرح هر کدام از اون ها رو در ادامه بیان میکنم.</p>
                         <ul style="list-style-type: decimal; padding-right: 20px;">
                          <li>برای مدیریت stateهامون از redux و برای برقراری ارتباط با server از axios استفاده شده.عملیات های CRUD ما بر روی سه بخش (آموزش ها،اساتید و دسته بندی ها) صورت میگیره و به این صورت عمل می کنه که به طور مثال برای ساخت یک آموزش ،تمامی اطلاعات وارد شده توسط admin که به وسیله ی فرم گرفته می شه به سمت server ارسال شده و در back-end صحت اطلاعات بررسی میشه و در صورت صحیح بودن،این اطلاعات در پایگاه داده ذخیره شده و پیغام موفقیت آمیز بودن عملیات برای ما ارسال میشه.</li>
                          <li>همان طور که قبلا اشاره شد سایت ما دارای دو بخش می باشد که یک بخش برای کاربران عادی و بخش دیگر برای admin طراحی شده.کاربران عادی برای برخی مسائل مثل نظر دادن یا ثبت نام در یک آموزش نیازمند ثبت نام در سایت و login هستند.admin نیز برای دسترسی به بخش مخصوص خودش که در اون بخش توانایی ایجاد،ویرایش و حذف (آموزش ها،اساتید و دسته بندی ها) رو داره باید login کنه.باید توجه داشته باشید که کاربران به قسمت admin سایت دسترسی ندارند.</li>
                          <li>توانایی جستجو کردن برای آموزش ها،اساتید و دسته بندی ها در سایت موجود هست.همچنین آموزش ها رو می توان بر اساس قیمتشون و یا تاریخ ایجادشون فیلتر کرد.</li>
                          <li>آموزش ها،اساتید و دسته بندی ها همگی دارای صفحه بندی می باشند و کاربر به راحتی میتونه به صفحات مختلف رفته و آموزش ها و یا هر آن چیزی که مد نظرش هست رو پیدا کنه.</li>
                          <li>این سایت دارای سبد خرید نیز هست و هر کاربری می تونه آموزش های مدنظرش رو انتخاب کرده و خریداری کنه.</li>
                          <li>سایت responsive بوده و در نمایشگرهای مختلف به خوبی نمایش داده می شه.</li>
                          <li>تمامی فرم های موجود در سایت دارای validation هستند و تمامی سناریوهای مخربی که ممکن هست توسط کاربران پیش بیاد سازماندهی شده و پیام های مرتبط با اون ها ارسال می شود.</li>
                         </ul>
                        </div>
                    `,
        skills: ["react", "javascript", "html", "tailwind", "redux", "axios", "nodejs", "mongodb"],
        githubHref:"https://github.com/Hossein707/online-learning-site"
    }
    ,
    {
        id: "2",
        image: contactimg,
        video: contactvid,
        title: "مدیریت مخاطبین",
        content: "این نمونه کار یک مدیریت کننده ی مخاطب است که بخش front-end آن با react و بخش back-end آن با nodejs نوشته شده.این پروژه دارای قابلیت های جستجو،اضافه،حذف و ویرایش مخاطب است.",
        fullcontent: "این نمونه کار یک مدیریت کننده ی مخاطب است که بخش front-end آن با react و بخش back-end آن با nodejs نوشته شده.این پروژه دارای قابلیت های جستجو،اضافه،حذف و ویرایش مخاطب است.برای عملیات اضافه،ویرایش و حذف مخاطب برنامه از طریق axios با server ارتباط برقرار کرده و درخواست مورد نظر رو ارسال و در صورت صحیح بودن داده ی ارسالی،داده عملیات مورد نظر رو انجام میده.ما برای اینکه از داده هایی که کاربر ارسال میکنه اطمینان حاصل کنیم برای فرممون یک اعتبارسنجی انجام دادیم که به این ترتیب از ارسال داده ی نادرست به سرور جلوگیری میکنیم.برای ساخت مخاطب داده هامون رو به سرور ارسال کرده و در صورت صحیح بودن،این اطلاعات در پایگاه داده ما ذخیره می شود و ما نیز پیام موفقیت آمیز بودن عملیات رو دریافت می کنیم.همچنین برای دریافت و نمایش تمامی مخاطبینمون یک درخواست به سرور ارسال میشه و تمامی مخاطبین رو درخواست میکنه که سرور ما از پایگاه دادمون تمامی مخاطبین رو دریافت کرده و به عنوان جواب به ما برمی گردونه.در این پروژه من از مواردی همچون react و nodejs(برای نوشتن restfull api) و mongoDB و axios(برای ارتباط با سرور) و yup(برای validation فرم) بهره بردم.",
        skills: ["react", "nodejs", "html", "css", "javascript", "axios", "yup", "mongodb"],
        githubHref: "https://github.com/Hossein707/contact-manager-app"
    }
    ,
    {
        id: "3",
        image: furnitureimg,
        video: furniturevid,
        title: "سایت دکوراسیون خانه",
        content: "این سایت با زبان های html و css و javascript طراحی شده و به صورت responsive می باشد.از قابلیت هایی همچون flex box و css grid نیز برای چیدمان المان های مختلف سایت استفاده شده است",
        fullcontent: "این سایت با زبان های html و css و javascript طراحی شده و به صورت responsive می باشد.از قابلیت هایی همچون flex box و css grid نیز برای چیدمان المان های مختلف سایت استفاده شده است.این سایت دارای چندین بخش همچون گالری،محصولات،پست ها و ... هست که همگی دارای تم رنگی و حال و هوایی مشابه به هم هستند که باعث میشه کاربر بتونه ارتباط خوبی با سایت ما برقرار کنه.",
        skills: ["html", "css", "sass", "javascript"],
        githubHref: "https://github.com/Hossein707/furniture-website-github",
        livedemoHref: "https://hossein707.github.io/furniture-website-github"
    }
    ,
    {
        id: "4",
        image: zabinimg,
        title: "بازی افسانه زابین",
        content: "یک بازی موبایلی ساخته ی استودیو staring abyss که من هم بعنوان عضو کوچکی از این گروه در ساخت و توسعه ی این بازی دخیل بودم و بخشی از برنامه نویسی این بازی رو برعهده داشتم.",
        fullcontent: "یک بازی موبایلی ساخته ی استودیو staring abyss که من هم بعنوان عضو کوچکی از این گروه در ساخت و توسعه ی این بازی دخیل بودم و بخشی از برنامه نویسی این بازی رو برعهده داشتم.در این پروژه کار بر کردن روی مفاهیمی همچون سیستم save و load بازی،سیستم playerprefs،همچنین کار با فایل های json ،سیسیتم حرکت کاراکتر و بخش ui بازی به عهده ی بنده بود.در پروژه افسانه زابین کار بر روی api تبلیغات و پرداخت های درون برنامه ای نیز بر عهده ی من بود.",
        skills: ["unity", "c#"],
        downloadLink: "https://cafebazaar.ir/app/com.staringabyss.zobin"
    }
    ,
    {
        id: "5",
        image: groceryimg,
        video: groceryvid,
        title: "سایت میوه و سبزیجات",
        content: "سایتی در مورد فروش میوه جات و لبنیات.یک سایت تک صفحه ای که responsive بوده و روی صفحات نمایش مختلف به خوبی اجرا میشه.در این پروژه از sass برای استفاده ی حرفه ای تر و آسان تر از قابلیت های css استفاده شده.",
        fullcontent: "سایتی در مورد فروش میوه جات و لبنیات.یک سایت تک صفحه ای که responsive بوده و روی صفحات نمایش مختلف به خوبی اجرا میشه.در این پروژه از sass برای استفاده ی حرفه ای تر و آسان تر از قابلیت های css استفاده شده.در برخی از بخش های این سایت مثل محصولات از sliderها استفاده شده که کاربر میتونه با راست و چپ بردن موس یا touch گوشی تمامی محصولات مورد نظرش رو مشاهده کنه.در این نمونه سایت منوهای متفاوتی همچون منوی خرید،منوی login و منوی اصلی سایت طراحی شده است.در طراحی اجزای مختلف سایت سعی شده که تمامی طرح ها و تم های رنگی به همدیگر نزدیک بوده و یک حال و هوای مشابه ای رو برای کاربر به وجود بیاورند.",

        skills: ["html", "css", "sass", "javascript"],
        githubHref: "https://github.com/Hossein707/GroceryStore-github",
        livedemoHref: "https://hossein707.github.io/GroceryStore-github"
    }
    ,
    {
        id: "6",
        image: adventureimg,
        video: adventurevid,
        title: "سایت تور مسافرتی",
        content: "سایتی تک صفحه ای در رابطه با تورهای مسافرتی و فروش بسته های مسافرتی و محصولات مرتبط.سایت responsive بوده و از قابلیت هایی همچون sass و css grid و flex box درش استفاده شده.",
        fullcontent: "سایتی تک صفحه ای در رابطه با تورهای مسافرتی و فروش بسته های مسافرتی و محصولات مرتبط.سایت responsive بوده و از قابلیت هایی همچون sass و css grid و flex box درش استفاده شده.در چندین بخش این سایت از slider استفاده شده که این قابلیت رو به ما میده تا در یک فضای محدود و ثابت بتونیم چندین آیتم رو به نمایش بگزاریم.طراحی کلی سایت و اجزای مختلفش نزدیک به هم بوده و همین امر باعث جذب مخاطب میشه.در هر کدام از نمونه کارهام سعی کردم از طراحی ها و چینش های متفاوتی استفاده کنم تا مهارت های خودم رو در زمینه ی کار کردن با html،css و ... به شما مخاطبین عزیز نشان بدم.",
        skills: ["html", "css", "sass", "javascript"],
        githubHref: "https://github.com/Hossein707/adventureWebsite-github",
        livedemoHref: "https://hossein707.github.io/adventureWebsite-github"
    }
    ,
    {
        id: "7",
        image: educationimg,
        video: educationvid,
        title: "سایت آموزشی",
        content: "نمونه سایتی مشابه با سایت های آموزش آنلاین.این سایت دارای چندین صفحه است که هر صفحه بخش های مختلف سایت رو به نمایش میزاره.سایت responsive هست و روی صفحه نمایش های مختلف قابل اجراست.",
        fullcontent: "نمونه سایتی مشابه با سایت های آموزش آنلاین.این سایت دارای چندین صفحه است که هر صفحه بخش های مختلف سایت رو به نمایش میزاره.سایت responsive هست و روی صفحه نمایش های مختلف قابل اجراست.تمامی این پروژه با html،css و javascript زده شده و هدف از انجام این پروژه و طراحی المنت ها و دکمه ها و کارت های متنوع ،نمایش مهارت های خودم در زمینه ی طراحی و تولید وب سایت ها و توسعه ی front-end است.",
        skills: ["html", "css", "sass", "javascript"],
        githubHref: "https://github.com/Hossein707/EducationWebsite-github",
        livedemoHref: "https://hossein707.github.io/EducationWebsite-github"
    }
    ,
    {
        id: "8",
        image: smallimg,
        video: smallprojectvid,
        title: "نمونه پروژه های کوچک",
        content: "در این نمونه کار از html و css و javascript استفاده شده و بخش های کوچکی مثل ساعت ، تقویم ، صفحه بندی ، دکمه های مختلف و ... که در سایت ها مورد استفاده قرار میگیرد را طراحی کردم.",
        fullcontent: "در این نمونه کار از html و css و javascript استفاده شده و بخش های کوچکی مثل ساعت ، تقویم ، صفحه بندی ، دکمه های مختلف و ... که در سایت ها مورد استفاده قرار میگیرد را طراحی کردم.هدف از این طراحی ها نمایش مهارت های خودم در زمینه ی ایجاد و طراحی آیتم های متفاوت با استفاده ا html و css می باشد و اینکه هر آیتمی رو میتونم با این تکنولوژی ها طراحی کنم.",
        skills: ["html", "css", "javascript"],
        githubHref: "https://github.com/Hossein707/SmallWebProjects-github",
    }
    ,
    {
        id: "9",
        image: flowerimg,
        video: flowervid,
        title: "فروشگاه گل",
        content: "یک نمونه سایت ساده و در عین حال جذاب و با طرحی چشم نواز در ارتباط با گل و گیاهان.این سایت تک صفحه ای از چندین بخش اعم از header و درباره ی ما،محصولات،نظرات،ارتباط با ما و footer تشکیل شده که این بخش ها لازمه ی هر سایت و کسب و کاری هست و در اکثر سایت ها این موارد به چشم می خوره.",
        fullcontent: "یک نمونه سایت ساده و در عین حال جذاب و با طرحی چشم نواز در ارتباط با گل و گیاهان.این سایت تک صفحه ای از چندین بخش اعم از header و درباره ی ما،محصولات،نظرات،ارتباط با ما و footer تشکیل شده که این بخش ها لازمه ی هر سایت و کسب و کاری هست و در اکثر سایت ها این موارد به چشم می خوره.این سایت responsive بوده و در صفحات نمایش با سایز های متفاوت به درستی نمایش داده می شود.هدف ساخت این پروژه نمایش توانایی ها و مهارت های خودم در زمینه ساخت سایت با استفاده از html و css است.در این پروژه سعی کردم انواع متفاوتی از button و card و header رو طراحی کرده و همچنین چندین مورد از نحوه ی قرارگیری این المان ها در کنار همدیگر را به نمایش بگزارم.",
        skills: ["html", "css", "javascript"],
        githubHref: "https://github.com/Hossein707/flowerShop-github",
        livedemoHref: "https://hossein707.github.io/flowerShop-github"
    }
    ,
    {
        id: "10",
        image: rentcarimg,
        video: rentcarvid,
        title: "اجاره ماشین",
        content: "نمونه سایتی در رابطه با اجاره انواع ماشین ها که با html و css پیاده سازی شده.یک سایت تک صفحه ای و responsive که روی دستگاه های مختلف و با صفحات نمایش متفاوت به درستی نمایش داده می شود.هدف از ساخت این نمونه کار ،نشان دادن توانایی و مهارت خودم در کار کردن با html و css و ساخت المان های مختلف با این زبان ها است.",
        fullcontent: "نمونه سایتی در رابطه با اجاره انواع ماشین ها که با html و css پیاده سازی شده.یک سایت تک صفحه ای و responsive که روی دستگاه های مختلف و با صفحات نمایش متفاوت به درستی نمایش داده می شود.هدف از ساخت این نمونه کار ،نشان دادن توانایی و مهارت خودم در کار کردن با html و css و ساخت المان های مختلف با این زبان ها است.همچنین در این پروژه از sass نیز برای بهتر و سریع تر کار کردن با css ،بهره بردم.sass قابلیت های فرآوانی رو در اختیارتون میزاره تا بتونید خیلی آسان تر و سریع تر از css در پروژه هاتون استفاده کنید.برای ساختار بندی و نحوه ی قرارگیری المان ها در کنار همدیگه از flex box و css grid استفاده کردم و همچنین این المان ها در صفحات نمایش با سایز های متفاوت چینش مناسبی را دارا می باشند.",
        skills: ["html", "css", "sass", "javascript"],
        githubHref: "https://github.com/Hossein707/Rentcar-github",
        livedemoHref: "https://hossein707.github.io/Rentcar-github"
    }

]